@jacobbednarz I am experiencing this issue as well on the latest provider version. Doesn't seem like it has been fixed.

```
resource "cloudflare_ruleset" "zone_level_rate_limiting" {
  zone_id         = data.cloudflare_zone.current.id
  name             = "rate limiting"
  description   = "Rate Limiting Rules for ${var.domain}"
  kind               = "zone"
  phase            = "http_ratelimit"
  
  rules {
    action          = "managed_challenge"
    description  = "Ratelimit /signup"
    enabled        = true
    expression   = "(http.host eq \"secure.getjobber.com\" and http.request.uri.path eq \"/signup\")"

    ratelimit {
      characteristics     = [
        "cf.colo.id",
        "ip.src",
      ]
      period                         = 3600
      requests_per_period = 10
      requests_to_origin     = false
      mitigation_timeout     = 0
    }
  }
}
```

This seems to especially be an issue around rules with a `mitigation_timeout` of 0. I import the existing rule, but then when I run `terraform state show cloudflare_ruleset.zone_level_rate_limiting` the `mitigation_timeout` of 0 is not present in the state.

```
resource "cloudflare_ruleset" "zone_level_rate_limiting" {
    description = "Rate Limiting Rules for getjobber.com"
    id          = "xxxx"
    kind        = "zone"
    name        = "rate limiting"
    phase       = "http_ratelimit"
    zone_id     = "xxxx"

    rules {
        action       = "managed_challenge"
        description  = "Ratelimit /signup"
        enabled      = true
        expression   = "(http.host eq \"secure.getjobber.com\" and http.request.uri.path eq \"/signup\")"
        id           = "xxxx"
        last_updated = "2023-09-21 21:55:47.218282 +0000 UTC"
        ref          = "xxxx"
        version      = "1"

        ratelimit {
            characteristics     = [
                "cf.colo.id",
                "ip.src",
            ]
            period              = 3600
            requests_per_period = 10
            requests_to_origin  = false
        }
    }
}
```

Then `terraform plan` wants to add the `mitigation_timeout`

```

Terraform will perform the following actions:


  # cloudflare_ruleset.zone_level_rate_limiting will be updated in-place
  ~ resource "cloudflare_ruleset" "zone_level_rate_limiting" {
        id          = "cb569331511d46ec8ac1de079b1ec7dc"
        name        = "rate limiting"
        # (4 unchanged attributes hidden)

      ~ rules {
          ~ id           = "9eaef890f13547e3a386ef6080d3f7c1" -> (known after apply)
          ~ last_updated = "2023-09-21 21:55:47.218282 +0000 UTC" -> (known after apply)
          ~ ref          = "9eaef890f13547e3a386ef6080d3f7c1" -> (known after apply)
          ~ version      = "1" -> (known after apply)
            # (4 unchanged attributes hidden)

          ~ ratelimit {
              + mitigation_timeout  = 0
                # (4 unchanged attributes hidden)
            }
        }
    }
```

But `terraform apply` fails with this same error

![image](https://github.com/cloudflare/terraform-provider-cloudflare/assets/5447860/b0312db6-d3fe-4053-bd2e-827dd1e199bd)
